IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "==========================================".
           DISPLAY "  HELLO WORLD! WELCOME TO THE MAINFRAME.  ".
           DISPLAY "==========================================".
           STOP RUN.
